app/controllers/school_classes_controller.rb

    def show
        @school = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def edit
        @school = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]