app/controllers/students_controller.rb

    def update
        edit
        @student.update(student_params)
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Quang"], ["last_name", "Nguyen"], ["updated_at", "2021-03-18 03:36:15.850599"], ["id", 12]]